using CJieba
using Test
using CJieba_jll


@testset "CJieba.jl" begin
    s = "我是拖拉机学院手扶拖拉机专业的。不用多久，我就会升职加薪，当上CEO，走上人生巅峰。"

    @test_throws ArgumentError JIEBA(; user_words = "")

    jieba = JIEBA()

    # cut

    @test cut(jieba, "") == String[]

    @test cut(jieba, s) == ["我", "是", "拖拉机", "学院", "手扶拖拉机", "专业", "的", "。", "不用", "多久", "，", "我", "就", "会", "升职", "加薪", "，", "当上", "CEO", "，", "走上", "人生", "巅峰", "。"]

    @test cut(jieba, s; without="x") == ["我", "是", "拖拉机", "学院", "手扶拖拉机", "专业", "的", "不用", "多久", "我", "就", "会", "升职", "加薪", "当上", "CEO", "走上", "人生", "巅峰"]

    # tag

    @test tag(jieba, "") == String[]

    @test tag(jieba, s) == [("我", "r"), ("是", "v"), ("拖拉机", "n"), ("学院", "n"), ("手扶拖拉机", "n"), ("专业", "n"), ("的", "uj"), ("。", "x"), ("不用", "v"), ("多久", "m"), ("，", "x"), ("我", "r"), ("就", "d"), ("会", "v"), ("升职", "v"), ("加薪", "nr"), ("，", "x"), ("当上", "t"), ("CEO", "eng"), ("，", "x"), ("走上", "v"), ("人生", "n"), ("巅峰", "n"), ("。", "x")]

    # add user word

    add_word!(jieba, "拖拉机学院")

    @test cut(jieba, s) == ["我", "是", "拖拉机学院", "手扶拖拉机", "专业", "的", "。", "不用", "多久", "，", "我", "就", "会", "升职", "加薪", "，", "当上", "CEO", "，", "走上", "人生", "巅峰", "。"]

    @test tag(jieba, s) == [("我", "r"), ("是", "v"), ("拖拉机学院", "u"), ("手扶拖拉机", "n"), ("专业", "n"), ("的", "uj"), ("。", "x"), ("不用", "v"), ("多久", "m"), ("，", "x"), ("我", "r"), ("就", "d"), ("会", "v"), ("升职", "v"), ("加薪", "nr"), ("，", "x"), ("当上", "t"), ("CEO", "eng"), ("，", "x"), ("走上", "v"), ("人生", "n"), ("巅峰", "n"), ("。", "x")]

    # use after free

    free!(jieba)

    @test_throws ArgumentError cut(jieba, "")

    @test_throws ArgumentError tag(jieba, "")

    # create with user words
    tmp = undef
    JIEBA(; user_words = ["拖拉机学院"]) do jieba
        tmp = jieba
        @test cut(jieba, s) == ["我", "是", "拖拉机学院", "手扶拖拉机", "专业", "的", "。", "不用", "多久", "，", "我", "就", "会", "升职", "加薪", "，", "当上", "CEO", "，", "走上", "人生", "巅峰", "。"]
    end

    @test tmp.freed

    # one shots

    @test cut("") == String[]

    @test cut(s) == ["我", "是", "拖拉机", "学院", "手扶拖拉机", "专业", "的", "。", "不用", "多久", "，", "我", "就", "会", "升职", "加薪", "，", "当上", "CEO", "，", "走上", "人生", "巅峰", "。"]

    @test cut(s; without="x") == ["我", "是", "拖拉机", "学院", "手扶拖拉机", "专业", "的", "不用", "多久", "我", "就", "会", "升职", "加薪", "当上", "CEO", "走上", "人生", "巅峰"]

    @test tag("") == String[]

    @test tag(s) == [("我", "r"), ("是", "v"), ("拖拉机", "n"), ("学院", "n"), ("手扶拖拉机", "n"), ("专业", "n"), ("的", "uj"), ("。", "x"), ("不用", "v"), ("多久", "m"), ("，", "x"), ("我", "r"), ("就", "d"), ("会", "v"), ("升职", "v"), ("加薪", "nr"), ("，", "x"), ("当上", "t"), ("CEO", "eng"), ("，", "x"), ("走上", "v"), ("人生", "n"), ("巅峰", "n"), ("。", "x")]
end
